<?php

defined('BASEPATH') OR exit('No direct script access allowed');

/*
|-----------------------------------------------------
| 信控管理配置文件
|-----------------------------------------------------
*/

// 城市  由PM提供
$config['open_city'] = [
    1   => [
          'name' => '北京',
          'id'   => 1,
    ],
    2   => [
          'name' => '深圳',
          'id'   => 2,
    ],
    3   => [
        'name' => '广州',
        'id'   => 1,
    ],
    12  => [
        'name' => '济南',
        'id'   => 12,
    ],
    17  => [
        'name' => '成都',
        'id'   => 17,
    ],
    18  => [
        'name' => '重庆',
        'id'   => 1,
    ],
    23  => [
        'name' => '苏州',
        'id'   => 1,
    ],
    26  => [
        'name' => '太原',
        'id'   => 1,
    ],
    38  => [
        'name' => '南昌',
        'id'   => 1,
    ],
    85  => [
        'name' => '温州',
        'id'   => 1,
    ],
    134 => [
        'name' => '柳州',
        'id'   => 134,
    ],
    138 => [
        'name' => '曲靖',
        'id'   => 138,
    ],
];
