<?php
/*
 * 这个文件存放各种白名单
 */

// 不用sso登陆就可以访问接口的IP
$config['white_escape_sso'] = [
    '100.90.164.31:8013',
    '100.90.164.31:8088',
    //'100.90.164.31:8082',
    '100.90.164.31:8089',
    '100.90.164.31:8099',
    '10.179.132.61:8088',
    '100.95.100.106:8088',
    'www.itstool.com',
    '100.90.165.32:8088',
    'localhost:8000', //本地调试环境
];

// 白名单Ip及token就可以登陆
$config['white_token_clientip_escape'] = [
    '100.90.164.31'=>["c43694c21ae778f9de213e24db78e057"],  //验证token+ip
    '10.179.132.61'=>["c43694c21ae778f9de213e24db78e057"],  //验证token+ip
    '127.0.0.1'=>[], //不验token
];